มานี
มานีมีตา
กา
กามีตา
อา
อามีตา

อามีนา
นามีงู
นามีปู
กาดูปู
งูดูปู
มานีมานาอา

นามีรูงู
นามีรูปู
มานีพาโตมาหาอา
มานีพาโตมานา
มานีพาโตหาปู
มานีพาโตดูปู

สีเทา
ชูใจพาสีเทาไปหามานี
สีเทาไปหาโต
โตดีใจสีเทาก็ดีใจ
สีเทาไปหาโตไวฯ
มานีดีใจ
ชูใจก็ดีใจ
มานีมาหาชูใจไวฯ

โตมีตา
โตมีขา
โตมีหู
หูโตมีอะไร
โตเอาขาถูหู
ถูไปถูมา
โตถูหูไวไว

ปูนามีสีดำ
โตก็มีหูสีดำ
หูโตมีปูนา
มานีจะตีปูนา
ปูนาไปในรู

ชูใจกำมือ
ชูใจกำอะไรในมือ
มานีขอดูมือชูใจ
มีอะไรในมือชูใจ
ชูใจแบมือ
มานีแลดูมือชูใจ

ชูใจถืออะไร
ชูใจถือโบในมือ
ชูใจชูโบ
มานีแลดูโบในมือชูใจ

สีเทาดูใบบัว
ชูใจแลดูสีเทา
สีเทาชูคอดูใบบัว
มีตัวอะไรเกาะใบบัว
